Lambda School Data Science

*Unit 2, Sprint 1, Module 3*

---

# Ridge Regression

## Assignment

We're going back to our other **New York City** real estate dataset. Instead of predicting apartment rents, you'll predict property sales prices.

But not just for condos in Tribeca...

- [ ] Use a subset of the data where `BUILDING_CLASS_CATEGORY` == `'01 ONE FAMILY DWELLINGS'` and the sale price was more than 100 thousand and less than 2 million.
- [ ] Do train/test split. Use data from January â€”Â March 2019 to train. Use data from April 2019 to test.
- [ ] Do one-hot encoding of categorical features.
- [ ] Do feature selection with `SelectKBest`.
- [ ] Fit a ridge regression model with multiple features. Use the `normalize=True` parameter (or do [feature scaling](https://scikit-learn.org/stable/modules/preprocessing.html) beforehand â€”Â use the scaler's `fit_transform` method with the train set, and the scaler's `transform` method with the test set)
- [ ] Get mean absolute error for the test set.
- [ ] As always, commit your notebook to your fork of the GitHub repo.

The [NYC Department of Finance](https://www1.nyc.gov/site/finance/taxes/property-rolling-sales-data.page) has a glossary of property sales terms and NYC Building Class Code Descriptions. The data comes from the [NYC OpenData](https://data.cityofnewyork.us/browse?q=NYC%20calendar%20sales) portal.


## Stretch Goals

Don't worry, you aren't expected to do all these stretch goals! These are just ideas to consider and choose from.

- [ ] Add your own stretch goal(s) !
- [ ] Instead of `Ridge`, try `LinearRegression`. Depending on how many features you select, your errors will probably blow up! ðŸ’¥
- [ ] Instead of `Ridge`, try [`RidgeCV`](https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.RidgeCV.html).
- [ ] Learn more about feature selection:
    - ["Permutation importance"](https://www.kaggle.com/dansbecker/permutation-importance)
    - [scikit-learn's User Guide for Feature Selection](https://scikit-learn.org/stable/modules/feature_selection.html)
    - [mlxtend](http://rasbt.github.io/mlxtend/) library
    - scikit-learn-contrib libraries: [boruta_py](https://github.com/scikit-learn-contrib/boruta_py) & [stability-selection](https://github.com/scikit-learn-contrib/stability-selection)
    - [_Feature Engineering and Selection_](http://www.feat.engineering/) by Kuhn & Johnson.
- [ ] Try [statsmodels](https://www.statsmodels.org/stable/index.html) if youâ€™re interested in more inferential statistical approach to linear regression and feature selection, looking at p values and 95% confidence intervals for the coefficients.
- [ ] Read [_An Introduction to Statistical Learning_](http://faculty.marshall.usc.edu/gareth-james/ISL/ISLR%20Seventh%20Printing.pdf), Chapters 1-3, for more math & theory, but in an accessible, readable way.
- [ ] Try [scikit-learn pipelines](https://scikit-learn.org/stable/modules/compose.html).

In [0]:
#imports
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import category_encoders as ce
import seaborn as sns
import datetime as dt

In [0]:
%%capture
import sys

# If you're on Colab:
if 'google.colab' in sys.modules:
    DATA_PATH = 'https://raw.githubusercontent.com/LambdaSchool/DS-Unit-2-Applied-Modeling/master/data/'
    !pip install category_encoders==2.*

# If you're working locally:
else:
    DATA_PATH = '../data/'
    
# Ignore this Numpy warning when using Plotly Express:
# FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
import warnings
warnings.filterwarnings(action='ignore', category=FutureWarning, module='numpy')

In [0]:
import pandas as pd
import pandas_profiling

# Read New York City property sales data
df = pd.read_csv(DATA_PATH+'condos/NYC_Citywide_Rolling_Calendar_Sales.csv')

# Change column names: replace spaces with underscores
df.columns = [col.replace(' ', '_') for col in df]

# SALE_PRICE was read as strings.
# Remove symbols, convert to integer
df['SALE_PRICE'] = (
    df['SALE_PRICE']
    .str.replace('$','')
    .str.replace('-','')
    .str.replace(',','')
    .astype(int)
)

In [0]:
# BOROUGH is a numeric column, but arguably should be a categorical feature,
# so convert it from a number to a string
df['BOROUGH'] = df['BOROUGH'].astype(str)

In [0]:
# Reduce cardinality for NEIGHBORHOOD feature

# Get a list of the top 10 neighborhoods
top10 = df['NEIGHBORHOOD'].value_counts()[:10].index

# At locations where the neighborhood is NOT in the top 10, 
# replace the neighborhood with 'OTHER'
df.loc[~df['NEIGHBORHOOD'].isin(top10), 'NEIGHBORHOOD'] = 'OTHER'

In [0]:
df= df.dropna(axis = 1, how = 'all')

In [103]:
df.head()

  BOROUGH             NEIGHBORHOOD  ... SALE_PRICE   SALE_DATE
0       1                    OTHER  ...          0  01/01/2019
1       1                    OTHER  ...          0  01/01/2019
2       1                    OTHER  ...          0  01/01/2019
3       1                    OTHER  ...          0  01/01/2019
4       1  UPPER EAST SIDE (59-79)  ...          0  01/01/2019

[5 rows x 20 columns]

In [104]:
#convert the strings to dates

pd.to_datetime(pd.Series(['01/01/2019', '2010-01-10', None]))
df['SALE_DATE'] = pd.to_datetime(df['SALE_DATE'])
df['months'] = [d.month for d in df['SALE_DATE']]
df.months.value_counts()

1    6464
3    6105
2    5598
4    4873
Name: months, dtype: int64

In [105]:
df.tail()

      BOROUGH NEIGHBORHOOD  ...  SALE_DATE months
23035       4        OTHER  ... 2019-04-30      4
23036       4        OTHER  ... 2019-04-30      4
23037       4        OTHER  ... 2019-04-30      4
23038       4        OTHER  ... 2019-04-30      4
23039       4        OTHER  ... 2019-04-30      4

[5 rows x 21 columns]

# Use a subset of the data where BUILDING_CLASS_CATEGORY == '01 ONE FAMILY DWELLINGS' and the sale price was more than 100 thousand and less than 2 million.

In [106]:
df.BUILDING_CLASS_CATEGORY.value_counts()

01 ONE FAMILY DWELLINGS                       5061
02 TWO FAMILY DWELLINGS                       4567
10 COOPS - ELEVATOR APARTMENTS                3471
13 CONDOS - ELEVATOR APARTMENTS               3339
03 THREE FAMILY DWELLINGS                     1438
07 RENTALS - WALKUP APARTMENTS                 807
09 COOPS - WALKUP APARTMENTS                   672
15 CONDOS - 2-10 UNIT RESIDENTIAL              421
04 TAX CLASS 1 CONDOS                          418
44 CONDO PARKING                               366
17 CONDO COOPS                                 300
22 STORE BUILDINGS                             288
05 TAX CLASS 1 VACANT LAND                     288
12 CONDOS - WALKUP APARTMENTS                  256
14 RENTALS - 4-10 UNIT                         200
29 COMMERCIAL GARAGES                          147
08 RENTALS - ELEVATOR APARTMENTS               120
30 WAREHOUSES                                  105
21 OFFICE BUILDINGS                             96
31 COMMERCIAL VACANT LAND                       80
43 CONDO OFFICE BUILDINGS                       80
47 CONDO NON-BUSINESS STORAGE                   75
46 CONDO STORE BUILDINGS                        65
27 FACTORIES                                    54
06 TAX CLASS 1 - OTHER                          42
37 RELIGIOUS FACILITIES                         38
45 CONDO HOTELS                                 32
41 TAX CLASS 4 - OTHER                          30
11A CONDO-RENTALS                               30
16 CONDOS - 2-10 UNIT WITH COMMERCIAL UNIT      29
33 EDUCATIONAL FACILITIES                       24
28 COMMERCIAL CONDOS                            23
32 HOSPITAL AND HEALTH FACILITIES               21
26 OTHER HOTELS                                 15
23 LOFT BUILDINGS                                7
34 THEATRES                                      7
35 INDOOR PUBLIC AND CULTURAL FACILITIES         7
25 LUXURY HOTELS                                 6
36 OUTDOOR RECREATIONAL FACILITIES               4
49 CONDO WAREHOUSES/FACTORY/INDUS                4
48 CONDO TERRACES/GARDENS/CABANAS                3
38 ASYLUMS AND HOMES                             2
42 CONDO CULTURAL/MEDICAL/EDUCATIONAL/ETC        1
39 TRANSPORTATION FACILITIES                     1
Name: BUILDING_CLASS_CATEGORY, dtype: int64

In [107]:
df_new = df[(df['SALE_PRICE'] >= 100000 )& 
        (df['SALE_PRICE'] <= 2000000 )&
        (df['BUILDING_CLASS_CATEGORY'] == "01 ONE FAMILY DWELLINGS")]
df_new

      BOROUGH NEIGHBORHOOD  ...  SALE_DATE months
44          3        OTHER  ... 2019-01-01      1
61          4        OTHER  ... 2019-01-01      1
78          2        OTHER  ... 2019-01-02      1
108         3        OTHER  ... 2019-01-02      1
111         3        OTHER  ... 2019-01-02      1
...       ...          ...  ...        ...    ...
23029       4        OTHER  ... 2019-04-30      4
23031       4        OTHER  ... 2019-04-30      4
23032       4        OTHER  ... 2019-04-30      4
23033       4        OTHER  ... 2019-04-30      4
23035       4        OTHER  ... 2019-04-30      4

[3164 rows x 21 columns]

# Do train/test split. Use data from January â€” March 2019 to train. Use data from April 2019 to test.

In [108]:
df_jan_march = df_new[df_new['months'] < 4]
df_jan_march

      BOROUGH NEIGHBORHOOD  ...  SALE_DATE months
44          3        OTHER  ... 2019-01-01      1
61          4        OTHER  ... 2019-01-01      1
78          2        OTHER  ... 2019-01-02      1
108         3        OTHER  ... 2019-01-02      1
111         3        OTHER  ... 2019-01-02      1
...       ...          ...  ...        ...    ...
18129       5        OTHER  ... 2019-03-29      3
18130       5        OTHER  ... 2019-03-29      3
18132       5        OTHER  ... 2019-03-29      3
18134       5        OTHER  ... 2019-03-29      3
18147       4        OTHER  ... 2019-03-30      3

[2517 rows x 21 columns]

In [109]:
df_april = df_new[df_new['months'] == 4]
df_april

      BOROUGH NEIGHBORHOOD  ...  SALE_DATE months
18235       2        OTHER  ... 2019-04-01      4
18239       2        OTHER  ... 2019-04-01      4
18244       3        OTHER  ... 2019-04-01      4
18280       3        OTHER  ... 2019-04-01      4
18285       3        OTHER  ... 2019-04-01      4
...       ...          ...  ...        ...    ...
23029       4        OTHER  ... 2019-04-30      4
23031       4        OTHER  ... 2019-04-30      4
23032       4        OTHER  ... 2019-04-30      4
23033       4        OTHER  ... 2019-04-30      4
23035       4        OTHER  ... 2019-04-30      4

[647 rows x 21 columns]

In [0]:
train = df_jan_march

In [0]:
test = df_april

In [112]:
train.shape, test.shape

((2517, 21), (647, 21))

### Do one-hot encoding of categorical features.

In [113]:
test.describe(include='number')

              BLOCK          LOT  ...    SALE_PRICE  months
count    647.000000   647.000000  ...  6.470000e+02   647.0
mean    7522.236476    76.519320  ...  6.561168e+05     4.0
std     3856.230145   174.017087  ...  3.025571e+05     0.0
min      107.000000     1.000000  ...  1.000000e+05     4.0
25%     4494.000000    21.000000  ...  4.685000e+05     4.0
50%     7381.000000    41.000000  ...  5.990000e+05     4.0
75%    10844.500000    68.000000  ...  7.832500e+05     4.0
max    16350.000000  2202.000000  ...  2.000000e+06     4.0

[8 rows x 11 columns]

In [115]:
test.describe(exclude='number')

       BOROUGH NEIGHBORHOOD  ... BUILDING_CLASS_AT_TIME_OF_SALE            SALE_DATE
count      647          647  ...                            647                  647
unique       5            6  ...                             10                   23
top          4        OTHER  ...                             A1  2019-04-15 00:00:00
freq       376          611  ...                            268                   43
first      NaN          NaN  ...                            NaN  2019-04-01 00:00:00
last       NaN          NaN  ...                            NaN  2019-04-30 00:00:00

[6 rows x 10 columns]

In [116]:
train.describe(include='object')

       BOROUGH NEIGHBORHOOD  ... LAND_SQUARE_FEET BUILDING_CLASS_AT_TIME_OF_SALE
count     2517         2517  ...             2517                           2517
unique       5            6  ...              889                             11
top          4        OTHER  ...            4,000                             A1
freq      1209         2390  ...              235                            921

[4 rows x 9 columns]

In [117]:
train['NEIGHBORHOOD'].value_counts(normalize=True)

OTHER                 0.949543
FLUSHING-NORTH        0.030989
FOREST HILLS          0.006754
BOROUGH PARK          0.004768
ASTORIA               0.004370
BEDFORD STUYVESANT    0.003576
Name: NEIGHBORHOOD, dtype: float64

In [129]:
train['BOROUGH'].value_counts(normalize=True)

4    0.480334
5    0.263806
3    0.159317
2    0.096146
1    0.000397
Name: BOROUGH, dtype: float64

In [125]:
train['GROSS_SQUARE_FEET'].value_counts(normalize=True)

1440.0    0.016289
1280.0    0.013111
1200.0    0.012714
1296.0    0.012316
0.0       0.012316
            ...
2165.0    0.000397
2352.0    0.000397
7200.0    0.000397
892.0     0.000397
2567.0    0.000397
Name: GROSS_SQUARE_FEET, Length: 924, dtype: float64

In [118]:
train['ZIP_CODE'].value_counts(normalize=True)

10312.0    0.045689
10306.0    0.045292
10314.0    0.037743
11434.0    0.030592
11413.0    0.027811
             ...
10455.0    0.000397
11217.0    0.000397
11222.0    0.000397
10453.0    0.000397
10456.0    0.000397
Name: ZIP_CODE, Length: 123, dtype: float64

In [120]:
train['YEAR_BUILT'].value_counts(normalize=True)

1920.0    0.115217
1925.0    0.113230
1930.0    0.098133
1950.0    0.085419
1940.0    0.077076
            ...
1907.0    0.000397
1957.0    0.000397
2014.0    0.000397
1973.0    0.000397
1927.0    0.000397
Name: YEAR_BUILT, Length: 86, dtype: float64

In [124]:
sns.countplot(train['NEIGHBORHOOD'])

In [140]:
target = 'SALE_PRICE'
#features = ['NEIGHBORHOOD','BOROUGH','BUILDING_CLASS_AT_PRESENT','SALE_DATE']
high_cardinality = ['ADDRESS', 'LAND_SQUARE_FEET']
features = train.columns.drop([target] + high_cardinality)
features

Index(['BOROUGH', 'NEIGHBORHOOD', 'BUILDING_CLASS_CATEGORY',
       'TAX_CLASS_AT_PRESENT', 'BLOCK', 'LOT', 'BUILDING_CLASS_AT_PRESENT',
       'APARTMENT_NUMBER', 'ZIP_CODE', 'RESIDENTIAL_UNITS', 'COMMERCIAL_UNITS',
       'TOTAL_UNITS', 'GROSS_SQUARE_FEET', 'YEAR_BUILT',
       'TAX_CLASS_AT_TIME_OF_SALE', 'BUILDING_CLASS_AT_TIME_OF_SALE',
       'SALE_DATE', 'months'],
      dtype='object')

In [0]:
X_train = train[features]
y_train = train[target]

X_test = test[features]
y_test = test[target]

In [142]:
X_train.shape, X_test.shape

((2517, 18), (647, 18))

In [0]:
encoder = ce.OneHotEncoder(use_cat_names=True)
X_train = encoder.fit_transform(X_train)
X_test = encoder.fit_transform(X_test)

In [146]:
X_train

       BOROUGH_3  BOROUGH_4  ...  SALE_DATE  months
44             1          0  ... 2019-01-01       1
61             0          1  ... 2019-01-01       1
78             0          0  ... 2019-01-02       1
108            1          0  ... 2019-01-02       1
111            1          0  ... 2019-01-02       1
...          ...        ...  ...        ...     ...
18129          0          0  ... 2019-03-29       3
18130          0          0  ... 2019-03-29       3
18132          0          0  ... 2019-03-29       3
18134          0          0  ... 2019-03-29       3
18147          0          1  ... 2019-03-30       3

[2517 rows x 51 columns]

In [147]:
X_train.shape

(2517, 51)

In [148]:
# How many features do we have currently?
features = X_train.columns
n = len(features)
n

51